<template>
  <BreadCrumbsAppBar 
    :breadcrumbsItems="breadcrumbsItems" 
    @click="isDrawer = !isDrawer" 
  />
  <InformationNabigationDrower 
    v-model="isDrawer"
    :text="text"
  />
  <TenantCreate/>
</template>

<script setup lang="ts">
  
const isDrawer = ref(false)

const text = ref(
`家賃の安さや、色んな国と人と交流が持てるとの理由が人気を呼び、今ゲストハウスを利用する人が増えて
います。ゲストハウスを利用するメリットととしては、1つは費用面です。東京近辺でも家賃が5万円程度
で済む場合もありますし、賃貸しのアパートやマンションでかかる、敷金や礼金も掛からないことがほとんど
です。とにかく、家賃を安く済ませたという方には非常におすすめです。
2つ目は出会いの場になる点です。実家を出て、一人暮らしを始めると最初は友達も出来ず、なかなか心細い
状態になりがちです。新しい環境で積極的にいろんな人に声を掛けるのも難しいと思います。
しかしゲストハウスはその家賃の安さから、海外の方、色んな年齢の方が利用しており、家にいながら沢山の人
とコミュニケーションをとることが出来ます。ゲストハウスで知り合って結婚した、というカップルも少なく
ありません。女性の方でセキュリティ面で心配に思う方がいれば、女性専用のゲストハウスに住むのもよいで
しょう。
ゲストハウスを利用する際の注意点としては、いろんな方が共同で暮らし、水周りを共有する事になるので、
そのゲストハウスに設けられたルールに従わなければならないという点です。好きな時間にご飯を作ったりは
出来ないかもしれませんし、シャワーの設置数が少ない場合は自分の好きなときに入ることはできません。
もちろん共同で使いますので、汚したり散らかしたりするのはご法度。あとの人が気持ちよく使えるよう、
共同施設は綺麗に使う必要があります。また、これはゲストハウスに限ったことではありませんが、友達を
連れてきて夜中まで騒ぐなども出来ません。
このように一緒に暮らす人に迷惑をかけないように生活しなければなりませんので、自分の思い通りにしたい人
にはあまり向きません。ゲストハウスは良い点も沢山ありますが、共同生活ならではの注意点もあります。
ゲストハウスで暮らすことを検討する際には、この暮らしのスタイルが本当に自分にあっているかどうかをまず
確かめてからにするようにしましょう。（861文字）`)

const breadcrumbsItems = [
  {
    title: 'テナント',
    disabled: false,
    to: { path: '/tenants' },
  },
  {
    title: '作成',
    disabled: true,
    to: { path: '/tenants/create' },
  },
]

definePage({
  meta: {
    layout: 'Default',
  }
})
</script>
